class Food < ActiveHash::Base
  self.data = [
    #和食
    {id: 1, name: '---'}, {id: 2, name: '日本料理'}, {id: 3, name: '寿司'}, {id: 4, name: '魚介料理・海鮮料理'},
    {id: 5, name: '天ぷら・揚げ物'}, {id: 6, name: 'そば・うどん・麺類'}, {id: 7, name: 'うなぎ・どじょう・あなご'},
    {id: 8, name: '焼き鳥・串焼き・鳥料理'}, {id: 9, name: 'すき焼き・しゃぶしゃぶ'}, {id: 10, name: 'おでん'},
    {id: 11, name: 'お好み焼き・たこ焼き'}, {id: 12, name: '郷土料理'}, {id: 13, name: '丼もの'},
    {id: 14, name: '和食その他'},
    #洋食・西洋料理
    {id: 15, name: 'ステーキ・ハンバーグ'}, {id: 16, name: '鉄板焼き'},
    {id: 17, name: 'パスタ・ピザ'}, {id: 18, name: '洋食・欧風料理'}, {id: 19, name: 'フレンチ'},
    {id: 20, name: 'イタリアン'}, {id: 21, name: 'スペイン料理'}, {id: 22, name: '西洋各国料理'},
    #中華料理
    {id: 23, name: '中華料理'}, {id: 24, name: '餃子・肉まん'}, {id: 25, name: '中華粥'},
    {id: 26, name: '中華麺'},
    #アジア・エスニック料理
    {id: 27, name: '韓国料理'}, {id: 28, name: '東南アジア料理'},
    {id: 29, name: '南アジア料理'}, {id: 30, name: '西アジア料理'}, {id: 31, name: '中南米料理'},
    {id: 32, name: 'アフリカ料理'}, {id: 33, name: 'アジア・エスニック（その他）'},
    #焼肉・ホルモン
    {id: 34, name: '焼肉・ホルモン'}, {id: 35, name: 'ジンギスカン'},
    #鍋
    {id: 36, name: 'ちゃんこ鍋'}, {id: 37, name: 'うどんすき'},
    {id: 38, name: 'もつ鍋'}, {id: 39, name: '水炊き'}, {id: 40, name: 'ちりとり鍋・てっちゃん鍋'},
    {id: 41, name: '中国鍋・火鍋'}, {id: 42, name: '韓国鍋'}, {id: 43, name: 'タイスキ'},
    {id: 44, name: '鍋（その他）'},
    #居酒屋・ダイニングバー
    {id: 45, name: '居酒屋'}, {id: 46, name: 'ダイニングバー'},
    {id: 47, name: '居酒屋・ダイニングバー（その他）'},
    #創作料理・無国籍料理
    {id: 48, name: '創作料理'}, {id: 49, name: 'イノベーティブ・フュージョン'}, {id: 50, name: '無国籍料理'},
    #レストラン
    {id: 51, name: '定食・食堂'}, {id: 52, name: 'レストラン（その他）'},
    #カフェ
    {id: 53, name: 'カフェ'},
    # 喫茶店
    {id: 54, name: '喫茶店'},
    #スイーツ
    {id: 55, name: '洋菓子'}, {id: 56, name: '和菓子・甘味処'},
    {id: 57, name: '中華菓子'}, {id: 58, name: 'スイーツ（その他）'},
    #バー
    {id: 59, name: 'バー'},
    #パブ
    {id: 60, name: 'パブ'}, 
    #ラウンジ
    {id: 61, name: 'ラウンジ'},
    #ピアバー
    {id: 62, name: 'ピアバー'},
    #スポーツバー
    {id: 63, name: 'スポーツバー'},
    #バー・お酒（その他）
    {id: 64, name: '日本酒バー'}, {id: 65, name: '焼酎バー'},
    #旅館
    {id: 66, name: '旅館'},
    #オーベルジュ
    {id: 67, name: 'オーべルジュ'}
  ]

end
